def area(a, b):
    '''
    Вычисляет площадь прямоугольника.
    
    Параметры:
        a (float): длина прямоугольника
        b (float): ширина прямоугольника
    
    Возвращаемое значение:
        float: площадь прямоугольника

    '''
    return a * b

def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника.
    
    Параметры:
        a (float): длина прямоугольника
        b (float): ширина прямоугольника
    
    Возвращаемое значение:
        float: периметр прямоугольника

    '''
    return 2 * (a + b)
